Revit 2022 API
SlabShapeEditor Class
An object used for Slab Shape Editing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public class SlabShapeEditor
Visual Basic
Public Class SlabShapeEditor
Visual C++
public ref class SlabShapeEditor
Remarks
The SlabShapeEditor can be obtained from a slab object, such as a roof or floor.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SlabShapeEditor
See Also
SlabShapeEditor Members
Autodesk.Revit.DB Namespace